---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CanNotDeleteLastOpenView
source: html/3fc1bd54-c67a-a7d9-723e-79149ae74ebf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CanNotDeleteLastOpenView Property

Deleting of all open views in a project is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CanNotDeleteLastOpenView { get; }
```